aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/shift.c
/*
 * File:   shift.c
 * Author: ICE_MEGANE
 *
 * Created on 2020/03/5, 22:26
 */

#include <xc.h>
#include "userdefine.h"

#include "shift.h"

#include "./mcufunc/gpio.h"
#include "./mcufunc/adc.h"
#include "./tools/servo.h"
#include "radio_control.h"
#include "./tools/speedsens.h"
#include "./speedcontrol.h"


/* 変速状態定義 */
#define SHIFT_POSITION_UP                   ((u8)0)
#define SHIFT_POSITION_DOWN                 ((u8)1)
#define SHIFT_POSITION_STABLE               ((u8)2)      /* シフト位置 変化なし */

#define SHIFT_DRIVE_STOP_CNT                ((u8)10)     /* 10ms */
#define SHIFT_DRIVE_STOP_SPEED              ((u16)0)     /* 0rpm */

/* 時間定義 */
#define SHIFT_CLUTCH_ON_TO_OFF_WAIT_TIME    ((u16)100)
#define SHIFT_CLUTCH_OFF_TO_ON_WAIT_TIME    ((u16)50)
#define SHIFT_CLUTCH_OFF_TIME_KICK          ((u16)200)
#define SHIFT_CLUTCH_MEET_TIME              ((u16)1000)
#define SHIFT_CLUTCH_OFF_BY_STOP_TIME       ((u16)400)             /* 車が動いてないときのクラッチオフ(アイドリング移行用) 判断時間 */      /* 速度をどれだけ拾えるかに依存してくる。　ループタスク側で割り込みが何ms置きに来てるかみて低速まで検知できるようにしたほうがよさそう @@ */

/* クラッチ制御用定義 */
#define SHIFT_SERVO_ANGLE_CLUTCH_ON         SERVO_DEG_IDX__85
#define SHIFT_SERVO_ANGLE_CLUTCH_OFF        SERVO_DEG_IDX__0

/* オートマチック変速定義 */
/* ※メインMCU側では0~7の計8ポジションで指令を送っているため、idxは0始まり... */
#define SHIFT_POSI_THRESHOLD_NUM            ((u8)8)
#define SHIFT_AUTOMATIC_START_SHIFT_POSI    SHIFT_POSI_1            /* オートマは1速発進、空ぶかしなし */

/* マニュアル変速定義 */
#define SHIFT_MANUAL_START_SHIFT_POSI       SHIFT_POSI_0            /* 停止状態から動き出す際のギヤ位置は、初回は空ぶかし可能設定 */

/* ブリッピング制御定義 */
/* ブリッピングステータス */
#define SHIFT_BLIP_STATUS_WAITING           ((u8)0)                 /* ブリッピング待機中 */
#define SHIFT_BLIP_STATUS_COMPLETE_MATCH    ((u8)1)                 /* 回転数一致によりブリッピング完了 */
#define SHIFT_BLIP_STATUS_COMPLETE_TIMEOUT  ((u8)2)                 /* タイムアウトによりブリッピング完了 */
/*  */
#define SHIFT_BLIP_SPEED_ACCURACY           ((u16)100)              /* ブリッピングの正確さ 実写でいうとシフトチェンジのヘタクソ具合 */
#define SHIFT_BLIP_TIMEOUT                  ((u16)1000)         /*  */

/* 変速基準回転数定義 */
/* 実機のトルクを見て決めたい */
/* あんまり速度上がらない気がする */
/* ➡方針決め：インバータへの印加duty50%の時の出力で得られる回転数を閾値として設定する */
/* バッテリ電圧がなくなってきたときの対応はどうするか？上の方へはシフトできない仕様でOK？ */
#define SHIFT_POSI_0_APPR_RPM       ((u16)0)        /* ニュートラル */
#define SHIFT_POSI_1_APPR_RPM       ((u16)1000)
#define SHIFT_POSI_2_APPR_RPM       ((u16)2000)
#define SHIFT_POSI_3_APPR_RPM       ((u16)3000)
#define SHIFT_POSI_4_APPR_RPM       ((u16)4000)
#define SHIFT_POSI_5_APPR_RPM       ((u16)5000)
#define SHIFT_POSI_6_APPR_RPM       ((u16)8000)
#define SHIFT_POSI_7_APPR_RPM       ((u16)11000)
#define SHIFT_POSI_8_APPR_RPM       ((u16)14000)

#define SHIFT_POSI_CHG_HIS_MAX                ((u8)500)                /* 変速のヒステリシス最大値(実質、レブリミット) */

#define SHIFT_POSI_REMAIN_CNT       ((u16)300)       /* サーボの稼働累計時間よりは長くしないとダメ。 */


/* 変速比設定 (ギヤ比基準) */
/* 実際は小数なので、桁ましのために*10000 */
#define SHIFT_GEAR_RATIO_POSI_0     ((u16)1)        /* ニュートラル */
#define SHIFT_GEAR_RATIO_POSI_1     ((u16)512)
#define SHIFT_GEAR_RATIO_POSI_2     ((u16)718)
#define SHIFT_GEAR_RATIO_POSI_3     ((u16)1340)
#define SHIFT_GEAR_RATIO_POSI_4     ((u16)1879)
#define SHIFT_GEAR_RATIO_POSI_5     ((u16)3200)
#define SHIFT_GEAR_RATIO_POSI_6     ((u16)4488)
#define SHIFT_GEAR_RATIO_POSI_7     ((u16)8374)
#define SHIFT_GEAR_RATIO_POSI_8     ((u16)11743)


/* だめかも・・・↑この回転数は現在のシフト位置に対して、どこまで上げられるのかギヤ費によって決まる。モータの回転数範囲に対して、上の段でどこまで上がるのか・・・・*/
/* ある領域における電圧変化に対してどこまで回転数幅を持たせられるかはどうやって決めるのか？ */
/* ひとまず実装を進めるために暫定値として計算式を立てることにした 2026/04/06 */

/* @@メモ */
/* 変速域内でのdutyはリモコンのレバー位置に応じていつでも0~100で操作可能にする。 */
/* ただし、入力に対して実際の速度が上記のヒステリシス範囲を超えた場合、変速を行う */
/* →この制御が一番単純でいいんじゃないか説 */
/* 本来シフト位置に対してどの程度の回転数域に収めるかは運転者が決めるが、そこの判断をマイコンにやらせる */

/* ・・・この時のヒステリシスをレブリミットと定義するのが適切かも？？？ */
/* １つの変速範囲において、どこまで回転数を上げないと上のシフト位置に遷移できないか、そのレベルを可変にする・・・→あっている気がするンゴ */



/* 関数プロトタイプ宣言 */
static void func_shift_s_shift_mode_decide( void );
static void func_shift_s_shift_degree_calc( void );
static void func_shift_s_shift_position_req_decide( void );
static void func_shift_s_shift_position_decide_mode_manual( void );
static void func_shift_s_shift_position_decide_mode_automatic( void );
static void func_shift_s_shift_dir_judge( void );
static void func_shift_s_blip_control( void );
static void func_shift_s_clutch_control( void );
static void func_shift_s_shift_position_control( void );
static void func_shift_s_shift_sequence( void );

static u8 u8_shift_s_shift_chg_enable_wait_cnt;
static u8 u8_shift_s_shift_mode_req;
static u8 u8_shift_s_blip_req;
u8 u8_shift_g_shifting_sequence;
u8 u8_shift_g_shifting_sequence_before;
static u16 u16_shift_s_clutch_meet_cnt;
static u8 u8_shift_s_clutch_meet_angle;
static u8 u8_shift_s_clutch_meet_complete;

u8 u8_shift_g_shift_mode;
u8 u8_shift_g_shift_position_req;
u8 u8_shift_g_shift_position_output;
static u8 u8_shift_s_shift_dir;
u8 u8_shift_g_blip_complete_status;
static u8 u8_shift_s_shifting_complete;
static u16 u16_shift_s_blip_timeout_cnt;


u16 u16_shift_s_clutch_off_cnt;

static u16 u16_shift_s_auto_position_cnt;

/* パラメータ定義 */
/* 現在のシフト位置で、duty50%で出せる速度設定 */
static const u16 u16_shift_s_shift_posi_50per_speed_ary[ SHIFT_POSI_NUM ] =
{
    SHIFT_POSI_0_APPR_RPM,
    SHIFT_POSI_1_APPR_RPM,
    SHIFT_POSI_2_APPR_RPM,
    SHIFT_POSI_3_APPR_RPM,
    SHIFT_POSI_4_APPR_RPM,
    SHIFT_POSI_5_APPR_RPM,
    SHIFT_POSI_6_APPR_RPM,
    SHIFT_POSI_7_APPR_RPM,
    SHIFT_POSI_8_APPR_RPM,
};

const u16 u16_shift_s_gear_ratio_ary[ SHIFT_POSI_NUM ] =
{
    SHIFT_GEAR_RATIO_POSI_0,
    SHIFT_GEAR_RATIO_POSI_1,
    SHIFT_GEAR_RATIO_POSI_2,
    SHIFT_GEAR_RATIO_POSI_3,
    SHIFT_GEAR_RATIO_POSI_4,
    SHIFT_GEAR_RATIO_POSI_5,
    SHIFT_GEAR_RATIO_POSI_6,
    SHIFT_GEAR_RATIO_POSI_7,
    SHIFT_GEAR_RATIO_POSI_8,
};


/* 1つの関数の制御対象、目的を広げすぎない設計が望ましい */

/* グローバル変数 */
/**************************************************************/
/*  Function:                                                 */
/*  初期化関数                                                 */
/*                                                            */
/*                                                            */
/**************************************************************/
void func_shift_g_init( void )
{
    u8_shift_s_shift_mode_req = SHIFT_MODE_MANUAL;
    u8_shift_g_shift_mode = SHIFT_MODE_MANUAL;
    u8_shift_g_shift_position_req = SHIFT_POSI_0;
    u8_shift_g_shift_position_output = SHIFT_POSI_0;
    u8_shift_s_shift_chg_enable_wait_cnt = (u8)0;

    u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_STOP;
    u8_shift_g_shifting_sequence_before = SHIFT_SEQ_CLUTCH_OFF_STOP;

    u16_shift_s_clutch_off_cnt = (u16)0;
    u16_shift_s_clutch_meet_cnt = (u16)0;
    u8_shift_s_clutch_meet_angle = (u8)0;
    u8_shift_s_clutch_meet_complete = CLEAR;

