aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/shift.c
    u16_shift_s_auto_position_cnt = (u16)0;
    u8_shift_s_shift_dir = SHIFT_POSITION_UP;

    u8_shift_g_blip_complete_status = SHIFT_BLIP_STATUS_WAITING;
    u16_shift_s_blip_timeout_cnt = (u16)0;

    u8_shift_s_shifting_complete = CLEAR;
}

/**************************************************************/
/*  Function:                                                 */
/*  main関数                                                   */
/*                                                            */
/*                                                            */
/**************************************************************/
void func_shift_g_main( void )
{
    func_shift_s_shift_mode_decide();           /* 変則モード確定処理 */

    func_shift_s_shift_sequence();              /* 変速シーケンス制御 */        /* エンジン制御はこの処理が主体になるはず。 */
    func_shift_s_shift_position_req_decide();   /* シフト位置要求設定処理 */
    func_shift_s_shift_dir_judge();             /* 変速方向判定処理 */

    /* 出力制御 */
    func_shift_s_clutch_control();              /* クラッチ制御 */
    func_shift_s_blip_control();                /* ブリッピング制御 */
    func_shift_s_shift_position_control();      /* シフト位置出力制御 */
}

/**************************************************************/
/*  Function:                                                 */
/*  関数                                                      */
/*  シフト位置を確定させる                                      */
/*                                                            */
/**************************************************************/
static void func_shift_s_shift_position_req_decide( void )
{
    if( u8_shift_g_shift_mode == SHIFT_MODE_MANUAL )
    { /* マニュアルシフト */
        func_shift_s_shift_position_decide_mode_manual();
    }
    else if( u8_shift_g_shift_mode == SHIFT_MODE_AUTOMATIC )
    {
        func_shift_s_shift_position_decide_mode_automatic();
    }
    else
    {
        ;
    }
}

/**************************************************************/
/*  Function:                                                 */
/*  シフト位置確定制御 マニュアルバージョン                       */
/*                                                            */
/**************************************************************/
static void func_shift_s_shift_position_decide_mode_manual( void )
{
    if( ( gpio_g_paddle_shift_sw.u8_state == LOW ) &&
             ( gpio_g_paddle_shift_sw.u8_state_bf == MID ))
    { /* シフトアップ */
        if( u8_shift_g_shift_position_req < SHIFT_POSI_MAX )
        {
            u8_shift_g_shift_position_req++;
        }
        else
        {
            u8_shift_g_shift_position_req = SHIFT_POSI_MAX;
        }
    }
    else if( ( gpio_g_paddle_shift_sw.u8_state == HI ) &&
             ( gpio_g_paddle_shift_sw.u8_state_bf == MID ))
    { /* シフトダウン */
        if( u8_shift_g_shift_position_req > SHIFT_POSI_0 )
        {
            u8_shift_g_shift_position_req--;
        }
        else
        {
            u8_shift_g_shift_position_req = SHIFT_POSI_0;
        }
    }
    else
    { /* 要求なし */
        ;               /* 現在のシフト位置を維持 */
    }
}

/**************************************************************/
/*  Function:                                                 */
/*  シフト位置確定制御 オートマチックバージョン                   */
/*  一番ここが複雑になるかも                                    */
/**************************************************************/
static void func_shift_s_shift_position_decide_mode_automatic( void )
{
    u16 u16_shift_up_thr_speed;
    u16 u16_shift_down_thr_speed;
    u8 u8_shift_chg_dir;
    u16 u16_shift_his_speed;
    u32 u32_calc_buff;
    
    u16 u16_shift_thr_speed_his;        /* 変速閾値ヒステリシス */
    
    u16 u16_position_rpm_1minus;
    u16 u16_position_rpm_1plus;

    u8 u8_shift_position_req_before;

    u8 u8_shift_start_range;
    
    
    u8_shift_start_range = (u8)0;


    
    GPIO_OUT_DEBUG = SET;

    /* グローバル変数取得 */
    u8_shift_position_req_before = u8_shift_g_shift_position_req;

    /* 変速位置固定カウント */
    /* 変速後は一定時間変速を許可しない */
    if( u16_shift_s_auto_position_cnt < U16_MAX )
    {
        u16_shift_s_auto_position_cnt++;
    }
    
    /* アクセルON/OFF時の動作設定 */
    /* AT自動車特有の、ある速度域でアクセルON/OFFしても自然に速度がつながる制御の模擬 */
    /* 現在のスピードエリアを判別する */
    if( u8_sc_s_throttle_dir == SC_THROTTLE_DIR_NONE )
    { /* アクセル踏まれてない */
        u8_shift_g_shift_position_req = SHIFT_POSI_0;               /* エンジンブレーキがないことを再現するため、アクセル踏んでないときはニュートラル状態にする */
    }
    else if( ( u8_sc_s_throttle_dir        != SC_THROTTLE_DIR_NONE ) &&
             ( u8_sc_s_throttle_dir_before == SC_THROTTLE_DIR_NONE ) )
    { /* 今回がアクセルON初回 */
        for( u8_shift_start_range = SHIFT_POSI_0; u8_shift_start_range < SHIFT_POSI_MAX; u8_shift_start_range++ )
        { /* ※8速目は検索から除外、どのみち7速でbreakできなかったら、8速で出てくるため。 */
            if( u16_speedsens_g_speed_ave_1stgear <= u16_shift_s_shift_posi_50per_speed_ary[ u8_shift_start_range ] )
            { /* 現在の速度域から、最適な変速開始位置を探す */
                break;
            }
        }

        if( u8_shift_start_range == SHIFT_POSI_0 )
        { /* 0速 0rpmで停止判定だった */
            u8_shift_g_shift_position_req = SHIFT_POSI_1;              /* 始動時：1速を返す */
        }
        else
        {
            u8_shift_g_shift_position_req = u8_shift_start_range;              /* 1~8速を返す */
        }
    }
    else
    {
        ;
    }

    /* シフトチェンジのレブリミットレベルを算出する */
    /* ただし、現在のギヤ位置から見て、最大出力で到達できそうな回転数範囲に制限をかける */
    /* @@シフトダウンの下限値回転数が、１段下のシフトアップ回転数と被らないように注意する。実測合わせ要検討 */
    u32_calc_buff = (u32)0;
    u32_calc_buff = func_ud_g_calcmul_2x2_byte( (u16)u8_rc_g_ch_duty_tbl[RC_DUTY_CH_REV_LIMIT], (u16)SHIFT_POSI_CHG_HIS_MAX );
    u32_calc_buff = func_ud_g_calcdiv_4x4_byte( u32_calc_buff, (u32)RC_CH_DUTY_100P );
    u16_shift_thr_speed_his = (u16)u32_calc_buff;
    
    /* シフトチェンジの回転数閾値を計算する */
    if( u8_shift_g_shift_position_output == SHIFT_POSI_1 )
    { /* 現在1速：シフトアップのみ可能 */
        u16_shift_up_thr_speed   = u16_shift_s_shift_posi_50per_speed_ary[ SHIFT_POSI_1 ] + u16_shift_thr_speed_his;
        u16_shift_down_thr_speed = (u16)0;      /* @@ココの値どうしよう... */
    }
    else if( u8_shift_g_shift_position_output == SHIFT_POSI_MAX )
    { /* 現在8速：シフトダウンのみ可能 */
        u16_shift_up_thr_speed   = U16_MAX;    /* ひとまず変速不可能な回転数にしておく */
        if( u16_shift_s_shift_posi_50per_speed_ary[ SHIFT_POSI_MAX ] > u16_shift_thr_speed_his )
        {
            u16_shift_down_thr_speed = u16_shift_s_shift_posi_50per_speed_ary[ SHIFT_POSI_MAX - (u8)1 ] - u16_shift_thr_speed_his;
        }
    }
    else
    { /* "現在" 1～6速 */
        u16_shift_up_thr_speed = u16_shift_s_shift_posi_50per_speed_ary[ u8_shift_g_shift_position_output ] + u16_shift_thr_speed_his;
        u16_shift_down_thr_speed = u16_shift_s_shift_posi_50per_speed_ary[ u8_shift_g_shift_position_output ] - u16_shift_thr_speed_his;
    }
    
    /* 変速処理 */
    /* 変速要求設定 */
    if( u16_shift_s_auto_position_cnt > SHIFT_POSI_REMAIN_CNT )
    { /* 変速後は少し間を置く */

        /* アクセル踏んでいる */
        if( u16_speedsens_g_speed_ave_1stgear >= u16_shift_up_thr_speed )
        { /* シフトアップ閾値回転数を超えた */
            if( u8_shift_g_shift_position_req < SHIFT_POSI_MAX )
            {
                u8_shift_g_shift_position_req++;
            }
            else
            {
                u8_shift_g_shift_position_req = SHIFT_POSI_MAX;
            }
        }
        else if( u16_speedsens_g_speed_ave_1stgear <= u16_shift_down_thr_speed )
        {
            if( u8_shift_g_shift_position_req > SHIFT_POSI_1 )
            {
                u8_shift_g_shift_position_req--;
            }
            else
            {
                u8_shift_g_shift_position_req = SHIFT_POSI_1;               /* ※0速へ戻る判定は、アクセルOFFで行う※ */
            }
        }
        else
        { /* 50%出力での変速域内 */
            ;       /* 現在のシフトポジションを維持 */
        }
    }


    /* 変速発生時の処理 */
    if( u8_shift_position_req_before != u8_shift_g_shift_position_req )
    { /* シフト位置の更新があった */
        u16_shift_s_auto_position_cnt = (u16)0;
    }

    GPIO_OUT_DEBUG = CLEAR;
}


/**************************************************************/
/*  Function:                                                 */
/*  シフト位置出力処理                                          */
/*                                                            */
/**************************************************************/
static void func_shift_s_shift_position_control( void )
{
    u8 u8_shift_posi_recalc;

