aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/shift.c
    u8_shift_posi_recalc = SHIFT_POSI_0;

#if 0
    if( u 8_shift_s_posision_start_reset_req == SET )
    {
        u8_shift_g_shift_position_output = u8_shift_g_shift_position_req;       /* 変速状態を直ちに反映 */
        u 8_shift_s_posision_start_reset_req = CLEAR;                                  /* 要求クリア */
    }
#endif


    if( u8_shift_g_shifting_sequence == SHIFT_SEQ_CLUTCH_OFF_SHIFT_CHG )
    { /* 変速シーケンス内 / 変速後、クラッチを戻す前のタイミングで変速 */
        if( ( u8_shift_g_blip_complete_status == SHIFT_BLIP_STATUS_COMPLETE_MATCH   ) ||
            ( u8_shift_g_blip_complete_status == SHIFT_BLIP_STATUS_COMPLETE_TIMEOUT ) )
        { /* 変速シーケンスにきて いずれかの方法でブリッピング完了している */
            u8_shift_g_shift_position_output = u8_shift_g_shift_position_req;
            u8_shift_s_shifting_complete = SET;                 /* 変速完了 */
        }
        else
        {
            u8_shift_s_shifting_complete = CLEAR;               /* 変速未完了 */
        }
    }
    else
    {
        u8_shift_s_shifting_complete = CLEAR;           /* ひとまず変速なしの時は検完了扱い(使ってない) */
    }

    /* ニュートラル出力設定 */
    if( u8_shift_g_shift_position_output == SHIFT_POSI_0 )
    { /* 現在 0速 */
        U8_GPIO_G_OUT_NEUTRAL = SET;        /* 強制ニュートラル信号を出力 */
    }
    else
    {
        U8_GPIO_G_OUT_NEUTRAL = CLEAR;


        /* 0bit目 */
        /* 0-7で1を送っている都合上、現在のシフトポジションから１引いて伝える */
        u8_shift_posi_recalc = u8_shift_g_shift_position_output - (u8)1;

        if( ( u8_shift_posi_recalc & ((u8)0x01) ) != (u8)0 )
        { /* 0bit目が立っている */
            U8_GPIO_G_OUT_SHIFT_0 = SET;
        }
        else
        {
            U8_GPIO_G_OUT_SHIFT_0 = CLEAR;
        }

        /* 1bit目 */
        if( ( u8_shift_posi_recalc & ((u8)0x02) ) != (u8)0 )
        { /* 0bit目が立っている */
            U8_GPIO_G_OUT_SHIFT_1 = SET;
        }
        else
        {
            U8_GPIO_G_OUT_SHIFT_1 = CLEAR;
        }

        /* 2bit目 */
        if( ( u8_shift_posi_recalc & ((u8)0x04) ) != (u8)0 )
        { /* 0bit目が立っている */
            U8_GPIO_G_OUT_SHIFT_2 = SET;
        }
        else
        {
            U8_GPIO_G_OUT_SHIFT_2 = CLEAR;
        }
    }
}


/**************************************************************/
/*  Function:                                                 */
/*  変速モード確定関数                                          */
/*                                                            */
/**************************************************************/
static void func_shift_s_shift_mode_decide( void )
{
    u8 u8_mode_before;

    u8_mode_before = u8_shift_g_shift_mode;             /* 現在の設定を一度保存する */

    
    /* 変速モード 要求値の取得 */
    if( gpio_g_shift_mode_sw.u8_state == HI )
    {
        u8_shift_s_shift_mode_req = SHIFT_MODE_MANUAL;
    }
    else
    {
        u8_shift_s_shift_mode_req = SHIFT_MODE_AUTOMATIC;
    }

    /* 停止状態でのみ、シフト操作モードの変更を許可する */
    if( u16_speedsens_g_speed_ave_1stgear <= SHIFT_DRIVE_STOP_SPEED )               /* 1次ギヤで止まってる判定する場合、0,1,2のシフトレバーが接続状態でないとダメなので、条件としては微妙かも */
    { /* 現在車は停止している */
        u8_shift_g_shift_mode = u8_shift_s_shift_mode_req;          /* 現在の変速モード要求を反映する */
    }
}


/**************************************************************/
/*  Function:                                                 */
/*  クラッチサーボ制御状態更新処理                               */
/*                                                            */
/**************************************************************/
static void func_shift_s_shift_sequence( void )
{
    /* 前回までのシーケンスを保存 */
    u8_shift_g_shifting_sequence_before = u8_shift_g_shifting_sequence;

    /* シーケンス管理 */
    switch ( u8_shift_g_shifting_sequence )
    {
        case SHIFT_SEQ_CLUTCH_OFF_STOP:
            /* 車体が完全に停止状態のときのみ、ここに来ているとして設計 */

            //デバッグ
            if( u8_shift_g_shift_mode == SHIFT_MODE_AUTOMATIC )
            { /* 現在オートマ選択中 */
                if( u8_sc_s_throttle_dir != SC_THROTTLE_DIR_NONE )
                { /* スロットルONされた */
                    //u 8_shift_s_posision_start_reset_req = SET;                             /* アクセルONで即始動させる必要があるので、初期変速要求(始動時のギヤ位置を指定する) */     /* こちら側にシフト位置変更要件を入れると処理の流れが複雑化するのでやめた */
                    u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_BFORE_CHG;         /* すでにクラッチオフだが、まずは変速の初回ステップであるクラッチオフに遷移させる */
                }
            }
            else if( u8_shift_g_shift_mode == SHIFT_MODE_MANUAL )
            { /* 現在マニュアル選択中 */
                if( u8_shift_g_shift_position_req != u8_shift_g_shift_position_output )
                { /* 変速要求が発生している */
                    u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_SHIFT_CHG;          /* 停止状態での変速はすぐに変速シーケンスへ飛ぶ */
                }
                else if( u8_sc_s_throttle_dir != SC_THROTTLE_DIR_NONE )
                { /* スロットルONされた */
                    if( u8_shift_g_shift_position_output != SHIFT_POSI_0 )
                    { /* 現在0速(ニュートラルではない) */
                        u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_MEETING;            /* このタイミングで変速要求があった場合は、以降のシーケンスで受け付ける */
                    }
                }
            }
            break;

        case SHIFT_SEQ_CLUTCH_MEETING:
            /* 始動時のクラッチミート */
            if( u8_shift_s_clutch_meet_complete == SET )
            { /* 半クラッチ完了 */
                u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_ON_DRIVE;
            }
            break;
        
        case SHIFT_SEQ_CLUTCH_ON_DRIVE:
            /* ↓↓↓↓ココの条件もう少し考えたい */
            if( u16_shift_s_clutch_off_cnt < U16_MAX )
            {
                u16_shift_s_clutch_off_cnt++;
            }

            /* 駆動中は常時変速許可 */
            if( u8_shift_g_shift_position_output != u8_shift_g_shift_position_req )
            { /* シフトポジション要求が変化 */
                u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_BFORE_CHG;            /* クラッチOFFへ */
            }

            /* 停止判定 */
            if( u16_shift_s_clutch_off_cnt > SHIFT_CLUTCH_OFF_BY_STOP_TIME )
            { /* 車が動作中 or 変速後 or クラッチミート完了後 */
                if( u16_speedsens_g_speed_ave_1stgear <= (u16)200 )       /* @@回転を下限値まで見れるようにしておかないと、この条件が働いて無限に始動できないかもぉ？ */
                { /* 一定時間たってるのに車に動きがない */
                    if( u8_sc_s_throttle_dir == SC_THROTTLE_DIR_NONE )
                    { /* スロットル開けておらず停止している：単純に停止した */
                        u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_STOP;             /* クラッチ切る */
                    }
                    else
                    { /* スロットルを開けており、クラッチミート完了したのに速度が出ていない：起動負荷高くて始動できてない判定とする */
                        u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_KICK;             /* クラッチ蹴飛ばせッッ！！ */
                    }
                    u16_shift_s_clutch_off_cnt = (u16)0;
                }
            }
    #if 0
            /* クラッチキック要求 */
            else if(  )
            {
                u8_shift_s_shifting_status = SHIFT_SEQ_CLUTCH_OFF_KICK;            /* クラッチOFFへ */
            }
    #endif
            break;
        
        case SHIFT_SEQ_CLUTCH_OFF_BFORE_CHG:
            /* シフトチェンジ前のクラッチOFF */
            if( u16_shift_s_clutch_off_cnt < U16_MAX )
            {
                u16_shift_s_clutch_off_cnt++;
            }

            if( u16_shift_s_clutch_off_cnt > SHIFT_CLUTCH_ON_TO_OFF_WAIT_TIME )
            { /* クラッチOFFを最低維持する時間経過：サーボの動作応答を待つ */
                u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_SHIFT_CHG;
                u16_shift_s_clutch_off_cnt = (u16)0;
            }
            break;

        case SHIFT_SEQ_CLUTCH_OFF_SHIFT_CHG:
            /* シフトチェンジ */
            /*u8_shift_g_shift_position_output = u8_shift_g_shift_position_req;*/       /* シフト要求を反映 */      /* func_shift_s_shift_position_control() 側で制御 */
            if( u8_shift_s_shifting_complete == SET )           /* 変速完了 */
            { /*  */
                u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_AFTER_CHG;
            }
            break;

        case SHIFT_SEQ_CLUTCH_OFF_AFTER_CHG:
            /* シフトチェンジ後のクラッチOFF */
            if( u16_shift_s_clutch_off_cnt < U16_MAX )
            {
                u16_shift_s_clutch_off_cnt++;
            }
             
            if( u8_sc_s_throttle_dir == SC_THROTTLE_DIR_NONE )
            { /* スロットル開けずに変速した */
                u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_STOP;                 /* マニュアルモード、クラッチ切った状態での変速（ガチャガチャしてるだけ判定）：停止状態へ戻る */
            }
            else /* (u8_sc_s_throttle_dir!=SC_THROTTLE_DIR_NONE) && (u8_sc_s_throttle_dir_before!=SC_THROTTLE_DIR_NONE) */
            { /* アクセルをふかし続けている状態でシフトアップ発生 */
                if( u8_shift_g_blip_complete_status == SHIFT_BLIP_STATUS_COMPLETE_MATCH )     /* 回転数一致による変速 */
                {
                    if( u16_shift_s_clutch_off_cnt > SHIFT_CLUTCH_OFF_TO_ON_WAIT_TIME )           /* 最低限は、変速後もクラッチOFFを継続（変速用サーボの応答を待機） */
                    { /* クラッチOFFを最低維持する時間経過：変速用サーボの動作応答を待つ */
                        u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_ON_DRIVE;                 /* すぐにバチッとクラッチ繋ぐ */
                        u16_shift_s_clutch_off_cnt = (u16)0;
                    }
                }
                else
                { /* 速度が出てない状態でスロットル開けながら変速(始動) or タイムアウトにより何とか変速(回転数あってない) */
                    u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_MEETING;                  /* 半クラッチで繋ぐ */    /* @@半クラッチは、適切な速度域でない場合に、タイムアウトでクラッチ繋ぐ場合に使うほうが、実車の挙動に近いかも？ */
                }
            }

            break;

        case SHIFT_SEQ_CLUTCH_OFF_KICK:
            /* 過負荷気味なときのクラッチキック操作 */
            if( u16_shift_s_clutch_off_cnt < U16_MAX )
            {
                u16_shift_s_clutch_off_cnt++;
            }

